RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_tdet.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _FSL_TDET_H_
#define _FSL_TDET_H_

#include "fsl_common.h"

/*!
 * @addtogroup TDET
 * @{
 */

/*! @file */

/*******************************************************************************
 * Definitions
 *******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief Defines TDET driver version 2.0.0.
 *
 * Change log:
 * - Version 2.0.0
 *   - initial version
 */
#define FSL_TDET_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/*!
 * @brief TDET Update Mode.
 *
 * These constants allow TDET interrupts to be cleared if no tampering has been detected, while still preventing
 * the TDET Tamper Flag (SR[DTF]) from being cleared once it is set.
 */
typedef enum _tdet_update_mode
{
    kTDET_StatusLockNormal = 0U,     /*!< TDET Status Register cannot be written when the Status Register Lock bit
                                          within the Lock Register (LR[SRL]) is clear */
    kTDET_StatusLockWithTamper = 1U, /*!< TDET Status Register cannot be written when the Status Register Lock bit
                                          within the Lock Register (LR[SRL]) is clear and TDET Tamper Flag (SR[DTF])
                                          is set*/
} tdet_update_mode_t;

/*!
 * @brief TDET Active Tamper Clock Source.
 *
 * These constants define the clock source for Active Tamper Shift Register to configure in a TDET base.
 */
typedef enum _tdet_active_tamper_clock
{
    kTDET_ClockType1Hz  = 0U, /*!< clocked by 1 Hz prescaler clock  */
    kTDET_ClockType64Hz = 1U, /*!< clocked by 614 Hz prescaler clock */
} tdet_active_tamper_clock_t;

/*!
 * @brief TDET Control Register.
 *
 * This structure defines values for TDET Control Register.
 */
typedef struct _tdet_config
{
    bool innerClockAndPrescalerEnable; /*!< Enable/disable 32768 Hz clock within TDET and the TDET prescaler that
                                          generates 512 Hz, 64Hz and 1 Hz prescaler clocks  */
    bool tamperForceSystemResetEnable; /*!< Enable/disable assertion of chip reset when tampering is detected */
    enum _tdet_update_mode updateMode; /*!< Selects update mode for TDET Status Register */
    enum _tdet_active_tamper_clock
        clockSourceActiveTamper0; /*!< Selects clock source for Active Tamper Shift Register 0 */
    enum _tdet_active_tamper_clock
        clockSourceActiveTamper1; /*!< Selects clock source for Active Tamper Shift Register 1 */
    uint32_t prescaler;           /*!< Initial value for the TDET prescaler 15-bit value. */
} tdet_config_t;

/*!
 * @brief TDET Tamper Pin Polarity.
 *
 * These constants define tamper pin polarity to configure in a TDET base.
 */
typedef enum _tdet_pin_polarity
{
    kTDET_TamperPinPolarityExpectNormal   = 0U, /*!< Tamper pin expected value is not inverted  */
    kTDET_TamperPinPolarityExpectInverted = 1U, /*!< Tamper pin expected value is inverted */
} tdet_pin_polarity_t;

/*!
 * @brief TDET Tamper Pin Direction.
 *
 * These constants define tamper pin direction to configure in a TDET base.
 */
typedef enum _tdet_pin_direction
{
    kTDET_TamperPinDirectionIn  = 0U, /*!< Tamper pins configured as input  */
    kTDET_TamperPinDirectionOut = 1U, /*!< Tamper pins configured as output, drives inverse of expected value */
} tdet_pin_direction_t;

/*!
 * @brief TDET Glitch Filter Tamper Pin Sample Frequency.
 *
 * These constants define tamper pin glitch filter sample frequency to configure in a TDET base.
 */
typedef enum _tdet_glitch_filter_sample_freq
{
    kTDET_GlitchFilterSamplingEveryCycle8   = 0U, /*!<  Sample once every 8 cycles */
    kTDET_GlitchFilterSamplingEveryCycle32  = 1U, /*!<  Sample once every 32 cycles */
    kTDET_GlitchFilterSamplingEveryCycle128 = 2U, /*!<  Sample once every 128 cycles */
    kTDET_GlitchFilterSamplingEveryCycle512 = 3U, /*!<  Sample once every 512 cycles */
} tdet_glitch_filter_sample_freq_t;
/*!
 * @brief TDET Glitch Filter Tamper Pin Sample Width.
 *
 * These constants define tamper pin glitch filter sample width to configure in a TDET base.
 */
typedef enum _tdet_glitch_filter_sample_width
{
    kTDET_GlitchFilterSampleDisable = 0U, /*!<  Sampling disabled */
    kTDET_GlitchFilterSampleCycle2  = 1U, /*!<  Sample width pull enable/input buffer enable=2 cycles/1 cycle */
    kTDET_GlitchFilterSampleCycle4  = 2U, /*!<  Sample width pull enable/input buffer enable=4 cycles/2 cycles */
    kTDET_GlitchFilterSampleCycle8  = 3U, /*!<  Sample width pull enable/input buffer enable=8 cycles/4 cycles */
} tdet_glitch_filter_sample_width_t;

/*!
 * @brief TDET Glitch Filter Tamper Pin Clock Source.
 *
 * These constants define tamper pin glitch filter clock source to configure in a TDET base.
 */
typedef enum _tdet_glitch_filter_prescaler
{
    kTDET_GlitchFilterClock512Hz   = 0U, /*!< Glitch Filter on tamper pin is clocked by the 512 Hz prescaler clock */
    kTDET_GlitchFilterClock32768Hz = 1U, /*!< Glitch Filter on tamper pin is clocked by the 32768 Hz prescaler clock */
} tdet_glitch_filter_prescaler_t;

/*!
 * @brief TDET Glitch Filter Tamper Pin Expected Value.
 *
 * These constants define tamper pin glitch filter expected value to configure in a TDET base.
 */
typedef enum _tdet_glitch_filter_expected
{
    kTDET_GlitchFilterExpectedLogicZero     = 0U, /*!<  Expected value is logic zero */
    kTDET_GlitchFilterExpectedActTamperOut0 = 1U, /*!<  Expected value is active tamper 0 output */
    kTDET_GlitchFilterExpectedActTamperOut1 = 2U, /*!<  Expected value is active tamper 1 output */
    kTDET_GlitchFilterExpectedActTamperOutXOR =
        3U, /*!<  Expected value is active tamper 0 output XORed with active tamper 1 output */
} tdet_glitch_filter_expected_t;

/*!
 * @brief TDET Glitch Filter Tamper Pull Select.
 *
 * These constants define tamper pin glitch filter pull direction to configure in a TDET base.
 */
typedef enum _tdet_glitch_filter_pull
{
    kTDET_GlitchFilterPullTypeAssert = 0U, /*!< Tamper pin pull direction always asserts the tamper pin. */
    kTDET_GlitchFilterPullTypeNegate = 1U, /*!< Tamper pin pull direction always negates the tamper pin. */
} tdet_glitch_filter_pull_t;

/*!
 * @brief TDET Tamper Pin configuration registers.
 *
 * This structure defines values for TDET Pin Direction, Pin Polarity, and Glitch Filter registers.
 */
typedef struct _tdet_pin_config
{
    enum _tdet_pin_polarity pinPolarity;   /*!< Selects tamper pin expected value */
    enum _tdet_pin_direction pinDirection; /*!< Selects tamper pin direction */
    bool tamperPullEnable;                 /*!< Enable/disable pull resistor on the tamper pin */
    enum _tdet_glitch_filter_sample_freq tamperPinSampleFrequency; /*!< Selects tamper pin sample frequency */
    enum _tdet_glitch_filter_sample_width tamperPinSampleWidth;    /*!< Selects tamper pin sample width */
    bool glitchFilterEnable; /*!< Enable/disable glitch filter on the tamper pin */
    enum _tdet_glitch_filter_prescaler
        glitchFilterPrescaler; /*!< Selects the prescaler for the glitch filter on tamper pin */

    uint8_t glitchFilterWidth; /*!< 6-bit value to configure number of clock edges the input must remain stable for to
                                  be passed through the glitch filter for the tamper pin */

