RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_tdet.h
    enum _tdet_glitch_filter_expected tamperPinExpected; /*!< Selects tamper pin expected value */
    enum _tdet_glitch_filter_pull tamperPullSelect;      /*!< Selects the direction of the tamper pin pull resistor */
} tdet_pin_config_t;

/*! @brief List of TDET external tampers */
typedef enum _tdet_external_tamper_pin
{
    kTDET_ExternalTamper0 = 1U << 0,
    kTDET_ExternalTamper1 = 1U << 1,
    kTDET_ExternalTamper2 = 1U << 2,
    kTDET_ExternalTamper3 = 1U << 3,
    kTDET_ExternalTamper4 = 1U << 4,
    kTDET_ExternalTamper5 = 1U << 5,
    kTDET_ExternalTamper6 = 1U << 6,
    kTDET_ExternalTamper7 = 1U << 7
} tdet_external_tamper_pin_t;

/*!
 * @brief TDET Active Tamper Register Select.
 *
 * These constants are used to define activeTamperRegisterSelect argument to be used with
 * TDET_ActiveTamperConfigure().
 */
typedef enum _tdet_active_tamper_register
{
    kTDET_ActiveTamperRegister0 = 1u << 0,
    kTDET_ActiveTamperRegister1 = 1u << 1,
} tdet_active_tamper_register_t;

/*!
 * @brief TDET Active Tamper registers.
 *
 * This structure defines values for TDET Active Tamper Registers.
 */
typedef struct _tdet_active_tamper_config
{
    uint32_t activeTamperShift;      /*!< Active tamper shift register. initialize to non-zero value. */
    uint32_t activeTamperPolynomial; /*!< Polynomial of the active tamper shift register. */
} tdet_active_tamper_config_t;

/*!
 * @brief TDET Status Register flags.
 *
 * This provides constants for the TDET Status Register.
 */
typedef enum _tdet_status_flag
{
    kTDET_StatusTamperFlag            = 1U << DIGTMP_SR_DTF_SHIFT,    /*!< TDET  Digital Tamper Flag */
    kTDET_StatusTamperAcknowledgeFlag = 1U << DIGTMP_SR_TAF_SHIFT,    /*!< TDET Tamper Acknowledge Flag */
    kTDET_StatusClockTamper           = 1U << DIGTMP_IER_TIIE0_SHIFT, /*!< TDET Clock Tamper detected */
    kTDET_StatusConfigurationTamper   = 1U << DIGTMP_IER_TIIE1_SHIFT, /*!< TDET Configuration Tamper detected */
    kTDET_StatusVoltageTamper         = 1U << DIGTMP_IER_TIIE2_SHIFT, /*!< TDET Voltage Tamper detected */
    kTDET_StatusTemperatureTamper     = 1U << DIGTMP_IER_TIIE3_SHIFT, /*!< TDET Temperature Tamper detected */
    kTDET_StatusRamZeroizeTamper      = 1U << DIGTMP_IER_TIIE6_SHIFT, /*!< TDET RAM Zeroize Tamper detected */
    kTDET_StatusTamperPinTamper0      = 1U << DIGTMP_IER_TPIE0_SHIFT, /*!< TDET Tamper Pin 0 Tamper detected */
    kTDET_StatusTamperPinTamper1      = 1U << DIGTMP_IER_TPIE1_SHIFT, /*!< TDET Tamper Pin 1 Tamper detected */
    kTDET_StatusTamperPinTamper2      = 1U << DIGTMP_IER_TPIE2_SHIFT, /*!< TDET Tamper Pin 2 Tamper detected */
    kTDET_StatusTamperPinTamper3      = 1U << DIGTMP_IER_TPIE3_SHIFT, /*!< TDET Tamper Pin 3 Tamper detected */
    kTDET_StatusTamperPinTamper4      = 1U << DIGTMP_IER_TPIE4_SHIFT, /*!< TDET Tamper Pin 4 Tamper detected */
    kTDET_StatusTamperPinTamper5      = 1U << DIGTMP_IER_TPIE5_SHIFT, /*!< TDET Tamper Pin 5 Tamper detected */
    kTDET_StatusTamperPinTamper6      = 1U << DIGTMP_IER_TPIE6_SHIFT, /*!< TDET Tamper Pin 6 Tamper detected */
    kTDET_StatusTamperPinTamper7      = 1U << DIGTMP_IER_TPIE7_SHIFT, /*!< TDET Tamper Pin 7 Tamper detected */
    kTDET_StatusAll = DIGTMP_SR_DTF_MASK | DIGTMP_SR_TAF_MASK | DIGTMP_IER_TIIE0_MASK | DIGTMP_IER_TIIE1_MASK |
                      DIGTMP_IER_TIIE2_MASK | DIGTMP_IER_TIIE3_MASK | DIGTMP_IER_TIIE6_MASK | DIGTMP_IER_TPIE0_MASK |
                      DIGTMP_IER_TPIE1_MASK | DIGTMP_IER_TPIE2_MASK | DIGTMP_IER_TPIE3_MASK | DIGTMP_IER_TPIE4_MASK |
                      DIGTMP_IER_TPIE5_MASK | DIGTMP_IER_TPIE6_MASK |
                      DIGTMP_IER_TPIE7_MASK, /*!< Mask for all of the TDET Status Register bits */
} tdet_status_flag_t;

/*!
 * @brief TDET Interrupt Enable Register.
 *
 * This provides constants for the TDET Interrupt Enable Register.
 */
typedef enum _tdet_interrupt
{
    kTDET_InterruptTamper              = 1U << DIGTMP_IER_DTIE_SHIFT,  /*!< TDET Digital Tamper Interrupt  */
    kTDET_InterruptClockTamper         = 1U << DIGTMP_IER_TIIE0_SHIFT, /*!< TDET Clock Tamper Interrupt */
    kTDET_InterruptConfigurationTamper = 1U << DIGTMP_IER_TIIE1_SHIFT, /*!< TDET Configuration error */
    kTDET_InterruptVoltageTamper       = 1U << DIGTMP_IER_TIIE2_SHIFT, /*!< TDET Voltage Tamper */
    kTDET_InterruptTemperatureTamper   = 1U << DIGTMP_IER_TIIE3_SHIFT, /*!< TDET Temperature Tamper Interrupt */
    kTDET_InterruptRamZeroizeTamper    = 1U << DIGTMP_IER_TIIE6_SHIFT, /*!< TDET RAM Zeroize Tamper Interrupt */
    kTDET_InterruptTamperPinTamper0    = 1U << DIGTMP_IER_TPIE0_SHIFT, /*!< TDET Tamper Pin Tamper 0 Interrupt */
    kTDET_InterruptTamperPinTamper1    = 1U << DIGTMP_IER_TPIE1_SHIFT, /*!< TDET Tamper Pin Tamper 1 Interrupt */
    kTDET_InterruptTamperPinTamper2    = 1U << DIGTMP_IER_TPIE2_SHIFT, /*!< TDET Tamper Pin Tamper 2 Interrupt */
    kTDET_InterruptTamperPinTamper3    = 1U << DIGTMP_IER_TPIE3_SHIFT, /*!< TDET Tamper Pin Tamper 3 Interrupt */
    kTDET_InterruptTamperPinTamper4    = 1U << DIGTMP_IER_TPIE4_SHIFT, /*!< TDET Tamper Pin Tamper 4 Interrupt */
    kTDET_InterruptTamperPinTamper5    = 1U << DIGTMP_IER_TPIE5_SHIFT, /*!< TDET Tamper Pin Tamper 5 Interrupt */
    kTDET_InterruptTamperPinTamper6    = 1U << DIGTMP_IER_TPIE6_SHIFT, /*!< TDET Tamper Pin Tamper 6 Interrupt */
    kTDET_InterruptTamperPinTamper7    = 1U << DIGTMP_IER_TPIE7_SHIFT, /*!< TDET Tamper Pin Tamper 7 Interrupt */
    kTDET_InterruptTamperPinTamper_All = DIGTMP_IER_TPIE0_MASK | DIGTMP_IER_TPIE1_MASK | DIGTMP_IER_TPIE2_MASK |
                                         DIGTMP_IER_TPIE3_MASK | DIGTMP_IER_TPIE4_MASK | DIGTMP_IER_TPIE5_MASK |
                                         DIGTMP_IER_TPIE6_MASK |
                                         DIGTMP_IER_TPIE7_MASK, /*!< TDET All Tamper Pins Interrupt */
    kTDET_InterruptAll = DIGTMP_IER_DTIE_MASK | DIGTMP_IER_TIIE0_MASK | DIGTMP_IER_TIIE1_MASK | DIGTMP_IER_TIIE2_MASK |
                         DIGTMP_IER_TIIE3_MASK | DIGTMP_IER_TIIE6_MASK | DIGTMP_IER_TPIE0_MASK | DIGTMP_IER_TPIE1_MASK |
                         DIGTMP_IER_TPIE2_MASK | DIGTMP_IER_TPIE3_MASK | DIGTMP_IER_TPIE4_MASK | DIGTMP_IER_TPIE5_MASK |
                         DIGTMP_IER_TPIE6_MASK |
                         DIGTMP_IER_TPIE7_MASK, /*!< Mask to select all TDET Interrupt Enable Register bits */
} tdet_interrupt_t;

/*!
 * @brief TDET Tamper Enable Register.
 *
 * This provides constants for the TDET Tamper Enable Register.
 */
typedef enum _tdet_tamper
{
    kTDET_TamperClock         = 1U << DIGTMP_TER_TIE0_SHIFT, /*!< Clock Tamper Enable */
    kTDET_TamperConfiguration = 1U << DIGTMP_TER_TIE1_SHIFT, /*!< Configuration error Tamper Enable */
    kTDET_TamperVoltage       = 1U << DIGTMP_TER_TIE2_SHIFT, /*!< Voltage Tamper Enable */
    kTDET_TamperTemperature   = 1U << DIGTMP_TER_TIE3_SHIFT, /*!< Temperature Tamper Enable */
    kTDET_TamperRamZeroize    = 1U << DIGTMP_TER_TIE6_SHIFT, /*!< RAM Zeroize Tamper Enable */
    kTDET_TamperTamperPin0    = 1U << DIGTMP_TER_TPE0_SHIFT, /*!< Tamper Pin 0 Tamper Enable */
    kTDET_TamperTamperPin1    = 1U << DIGTMP_TER_TPE1_SHIFT, /*!< Tamper Pin 1 Tamper Enable */
    kTDET_TamperTamperPin2    = 1U << DIGTMP_TER_TPE2_SHIFT, /*!< Tamper Pin 2 Tamper Enable */
    kTDET_TamperTamperPin3    = 1U << DIGTMP_TER_TPE3_SHIFT, /*!< Tamper Pin 3 Tamper Enable */
    kTDET_TamperTamperPin4    = 1U << DIGTMP_TER_TPE4_SHIFT, /*!< Tamper Pin 4 Tamper Enable */
    kTDET_TamperTamperPin5    = 1U << DIGTMP_TER_TPE5_SHIFT, /*!< Tamper Pin 5 Tamper Enable */
    kTDET_TamperTamperPin6    = 1U << DIGTMP_TER_TPE6_SHIFT, /*!< Tamper Pin 6 Tamper Enable */
    kTDET_TamperTamperPin7    = 1U << DIGTMP_TER_TPE7_SHIFT, /*!< Tamper Pin 7 Tamper Enable */
    kTDET_TamperTamperPinAll  = DIGTMP_TER_TPE0_MASK | DIGTMP_TER_TPE1_MASK | DIGTMP_TER_TPE2_MASK |
                               DIGTMP_TER_TPE3_MASK | DIGTMP_TER_TPE4_MASK | DIGTMP_TER_TPE5_MASK |
                               DIGTMP_TER_TPE6_MASK | DIGTMP_TER_TPE7_MASK, /*!< All Tamper Pin Tamper Enable */
    kTDET_TamperAll = DIGTMP_TER_TIE0_MASK | DIGTMP_TER_TIE1_MASK | DIGTMP_TER_TIE2_MASK | DIGTMP_TER_TIE3_MASK |
                      DIGTMP_TER_TIE6_MASK | DIGTMP_TER_TPE0_MASK | DIGTMP_TER_TPE1_MASK | DIGTMP_TER_TPE2_MASK |
                      DIGTMP_TER_TPE3_MASK | DIGTMP_TER_TPE4_MASK | DIGTMP_TER_TPE5_MASK | DIGTMP_TER_TPE6_MASK |
                      DIGTMP_TER_TPE7_MASK, /*!< Mask to select all Tamper Enable Register bits */
} tdet_tamper_t;

/*!
 * @brief TDET Registers.
 *
 * This provides constants to encode a mask for the TDET Registers.
 */
typedef enum _tdet_register
{
    kTDET_NoRegister      = 0U,                         /*!< No Register */
    kTDET_Control         = 1U << DIGTMP_LR_CRL_SHIFT,  /*!< Control Register */
    kTDET_Status          = 1U << DIGTMP_LR_SRL_SHIFT,  /*!< Status Register */
    kTDET_Lock            = 1U << DIGTMP_LR_LRL_SHIFT,  /*!< Lock Register */
    kTDET_InterruptEnable = 1U << DIGTMP_LR_IEL_SHIFT,  /*!< Interrupt Enable Register */
    kTDET_TamperSeconds   = 1U << DIGTMP_LR_TSL_SHIFT,  /*!< Tamper Seconds Register */
    kTDET_TamperEnable    = 1U << DIGTMP_LR_TEL_SHIFT,  /*!< Tamper Enable Register */
    kTDET_PinDirection    = 1U << DIGTMP_LR_PDL_SHIFT,  /*!< Pin Direction Register */
    kTDET_PinPolarity     = 1U << DIGTMP_LR_PPL_SHIFT,  /*!< Pin Polarity Register */
    kTDET_ActiveTamper0   = 1U << DIGTMP_LR_ATL0_SHIFT, /*!< Active Tamper Register 0 */
    kTDET_ActiveTamper1   = 1U << DIGTMP_LR_ATL1_SHIFT, /*!< Active Tamper Register 1 */
    kTDET_GlitchFilter0   = 1U << DIGTMP_LR_GFL0_SHIFT, /*!< Glitch Filter Register 0 */
    kTDET_GlitchFilter1   = 1U << DIGTMP_LR_GFL1_SHIFT, /*!< Glitch Filter Register 1 */
    kTDET_GlitchFilter2   = 1U << DIGTMP_LR_GFL2_SHIFT, /*!< Glitch Filter Register 2 */
    kTDET_GlitchFilter3   = 1U << DIGTMP_LR_GFL3_SHIFT, /*!< Glitch Filter Register 3 */
    kTDET_GlitchFilter4   = 1U << DIGTMP_LR_GFL4_SHIFT, /*!< Glitch Filter Register 4 */
    kTDET_GlitchFilter5   = 1U << DIGTMP_LR_GFL5_SHIFT, /*!< Glitch Filter Register 5 */
    kTDET_GlitchFilter6   = 1U << DIGTMP_LR_GFL6_SHIFT, /*!< Glitch Filter Register 6 */
    kTDET_GlitchFilter7   = 1U << DIGTMP_LR_GFL7_SHIFT, /*!< Glitch Filter Register 7 */
    kTDET_PinConfigurationRegisters =
        DIGTMP_LR_PDL_MASK | DIGTMP_LR_PPL_MASK | DIGTMP_LR_ATL0_MASK | DIGTMP_LR_ATL1_MASK | DIGTMP_LR_GFL0_MASK |
        DIGTMP_LR_GFL1_MASK | DIGTMP_LR_GFL2_MASK | DIGTMP_LR_GFL3_MASK | DIGTMP_LR_GFL4_MASK | DIGTMP_LR_GFL5_MASK |
        DIGTMP_LR_GFL6_MASK | DIGTMP_LR_GFL7_MASK, /*!< Mask to select all TDET Pin Configuration Registers */
    kTDET_AllRegisters = DIGTMP_LR_CRL_MASK | DIGTMP_LR_SRL_MASK | DIGTMP_LR_LRL_MASK | DIGTMP_LR_IEL_MASK |
                         DIGTMP_LR_TSL_MASK | DIGTMP_LR_TEL_MASK | DIGTMP_LR_PDL_MASK | DIGTMP_LR_PPL_MASK |
                         DIGTMP_LR_ATL0_MASK | DIGTMP_LR_ATL1_MASK | DIGTMP_LR_GFL0_MASK | DIGTMP_LR_GFL1_MASK |
                         DIGTMP_LR_GFL2_MASK | DIGTMP_LR_GFL3_MASK | DIGTMP_LR_GFL4_MASK | DIGTMP_LR_GFL5_MASK |
                         DIGTMP_LR_GFL6_MASK | DIGTMP_LR_GFL7_MASK, /*!< Mask to select all TDET Registers */
} tdet_register_t;

