RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_tdet.h
/*******************************************************************************
 * API
 *******************************************************************************/
extern void VBAT0_DriverIRQHandler(void);

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @name TDET Functional Operation
 * @{
 */

/*!
 * @brief Initialize TDET
 *
 * This function initializes TDET.
 *
 * @param base TDET peripheral base address
 * @return Status of the init operation
 */
status_t TDET_Init(DIGTMP_Type *base);

/*!
 * @brief Deinitialize TDET
 *
 * This function disables glitch filters and active tampers
 * This function disables the TDET clock and prescaler in TDET Control Register.
 * @param base TDET peripheral base address
 */
void TDET_Deinit(DIGTMP_Type *base);

/*!
 * @brief Gets default values for the TDET Control Register.
 *
 * This function fills the given structure with default values for the TDET Control Register.
 * The default values are:
 * @code
 *     defaultConfig->innerClockAndPrescalerEnable = true
 *     defaultConfig->tamperForceSystemResetEnable = false
 *     defaultConfig->updateMode = kTDET_StatusLockWithTamper
 *     defaultConfig->clockSourceActiveTamper0 = kTDET_ClockType1Hz
 *     defaultConfig->clockSourceActiveTamper1 = kTDET_ClockType1Hz
 *     defaultConfig->prescaler = 0
 * @endcode
 * @param base TDET peripheral base address
 * @param[out] defaultConfig Pointer to structure to be filled with default parameters
 */
void TDET_GetDefaultConfig(DIGTMP_Type *base, tdet_config_t *defaultConfig);

/*!
 * @brief Writes to the TDET Control Register.
 *
 * This function writes the given structure to the TDET Control Register.
 * @param base TDET peripheral base address
 * @param config Pointer to structure with TDET peripheral configuration parameters
 * @return kStatus_Fail when writing to TDET Control Register is not allowed
 * @return kStatus_Success when operation completes successfully
 */
status_t TDET_SetConfig(DIGTMP_Type *base, const tdet_config_t *config);

/*!
 * @brief Software reset.
 *
 * This function resets all TDET registers. The CR[SWR] itself is not affected;
 * it is reset by VBAT POR only.
 *
 * @param base TDET peripheral base address
 * @return kStatus_Fail when writing to TDET Control Register is not allowed
 * @return kStatus_Success when operation completes successfully
 */
status_t TDET_SoftwareReset(DIGTMP_Type *base);

/*!
 * @brief Writes to the active tamper register(s).
 *
 * This function writes per active tamper register parameters to active tamper register(s).
 *
 * @param base TDET peripheral base address
 * @param activeTamperConfig Pointer to structure with active tamper register parameters
 * @param activeTamperRegisterSelect Bit mask for active tamper registers to be configured. The passed value is
 *                                   combination of tdet_active_tamper_register_t values (OR'ed).
 * @return kStatus_Fail when writing to TDET Active Tamper Register(s) is not allowed
 * @return kStatus_Success when operation completes successfully
 */
status_t TDET_ActiveTamperSetConfig(DIGTMP_Type *base,
                                    const tdet_active_tamper_config_t *activeTamperConfig,
                                    uint32_t activeTamperRegisterSelect);

/*!
 * @brief Gets default values for tamper pin configuration.
 *
 * This function fills the give structure with default values for the tamper pin and glitch filter configuration.
 * The default values are:
 * code
 *     pinConfig->pinPolarity = kTDET_TamperPinPolarityExpectNormal;
 *     pinConfig->pinDirection = kTDET_TamperPinDirectionIn;
 *     pinConfig->tamperPullEnable = false;
 *     pinConfig->tamperPinSampleFrequency = kTDET_GlitchFilterSamplingEveryCycle8;
 *     pinConfig->tamperPinSampleWidth = kTDET_GlitchFilterSampleDisable;
 *     pinConfig->glitchFilterEnable = false;
 *     pinConfig->glitchFilterPrescaler = kTDET_GlitchFilterClock512Hz;
 *     pinConfig->glitchFilterWidth = 0;
 *     pinConfig->tamperPinExpected = kTDET_GlitchFilterExpectedLogicZero;
 *     pinConfig->tamperPullSelect = kTDET_GlitchFilterPullTypeAssert;
 * endcode
 *
 * @param base TDET peripheral base address
 * @param[out] pinConfig Pointer to structure to be filled with tamper pins default parameters
 */

void TDET_PinGetDefaultConfig(DIGTMP_Type *base, tdet_pin_config_t *pinConfig);

/*!
 * @brief Writes the tamper pin configuration.
 *
 * This function writes per pin parameters to tamper pin and glitch filter configuration registers.
 *
 * @param base TDET peripheral base address
 * @param pinConfig Pointer to structure with tamper pin and glitch filter configuration parameters
 * @param pinSelect Bit mask for tamper pins to be configured. The passed value is combination of
 *                  enum _tdet_tamper_pin (tdet_tamper_pin_t) values (OR'ed).
 * @return kStatus_Fail when writing to TDET Pin Direction, Pin Polarity or Glitch Filter Register(s) is not allowed
 * @return kStatus_Success when operation completes successfully
 */
status_t TDET_PinSetConfig(DIGTMP_Type *base, const tdet_pin_config_t *pinConfig, uint32_t pinSelect);

/*!
 * @brief Reads the Status Register.
 *
 * This function reads flag bits from TDET Status Register.
 *
 * @param base TDET peripheral base address
 * @param[out] result Pointer to uint32_t where to write Status Register read value. Use tdet_status_flag_t to decode
 *                    individual flags.
 * @return kStatus_Fail when Status Register reading is not allowed
 * @return kStatus_Success when result is written with the Status Register read value
 */
status_t TDET_GetStatusFlags(DIGTMP_Type *base, uint32_t *result);

/*!
 * @brief Writes to the Status Register.
 *
 * This function clears specified flag bits in TDET Status Register.
 *
 * @param base TDET peripheral base address
 * @param mask Bit mask for the flag bits to be cleared. Use tdet_status_flag_t to encode flags.
 * @return kStatus_Fail when Status Register writing is not allowed
 * @return kStatus_Success when mask is written to the Status Register
 */
status_t TDET_ClearStatusFlags(DIGTMP_Type *base, uint32_t mask);

/*!
 * @brief Writes to the Interrupt Enable Register.
 *
 * This function sets specified interrupt enable bits in TDET Interrupt Enable Register.
 *
 * @param base TDET peripheral base address
 * @param mask Bit mask for the interrupt enable bits to be set.
 * @return kStatus_Fail when Interrupt Enable Register writing is not allowed
 * @return kStatus_Success when mask is written to the Interrupt Enable Register
 */
status_t TDET_EnableInterrupts(DIGTMP_Type *base, uint32_t mask);

/*!
 * @brief Writes to the Interrupt Enable Register.
 *
 * This function clears specified interrupt enable bits in TDET Interrupt Enable Register.
 *
 * @param base TDET peripheral base address
 * @param mask Bit mask for the interrupt enable bits to be cleared.
 * @return kStatus_Fail when Interrupt Enable Register writing is not allowed
 * @return kStatus_Success when specified bits are cleared in the Interrupt Enable Register
 */
status_t TDET_DisableInterrupts(DIGTMP_Type *base, uint32_t mask);

/*!
 * @brief Writes to the Tamper Enable Register.
 *
 * This function sets specified tamper enable bits in TDET Tamper Enable Register.
 *
 * @param base TDET peripheral base address
 * @param mask Bit mask for the tamper enable bits to be set.
 * @return kStatus_Fail when Tamper Enable Register writing is not allowed
 * @return kStatus_Success when mask is written to the Tamper Enable Register
 */
status_t TDET_EnableTampers(DIGTMP_Type *base, uint32_t mask);

/*!
 * @brief Writes to the Tamper Enable Register.
 *
 * This function clears specified tamper enable bits in TDET Tamper Enable Register.
 *
 * @param base TDET peripheral base address
 * @param mask Bit mask for the tamper enable bits to be cleared.
 * @return kStatus_Fail when Tamper Enable Register writing is not allowed
 * @return kStatus_Success when specified bits are cleared in the Tamper Enable Register
 */
status_t TDET_DisableTampers(DIGTMP_Type *base, uint32_t mask);

/*!
 * @brief Writes to the Tamper Seconds Register.
 *
 * This function writes to TDET Tamper Seconds Register. This causes Status Register DTF flag to be set (TDET
 * tampering detected).
 *
 * @param base TDET peripheral base address
 * @return kStatus_Fail when Tamper Seconds Register writing is not allowed
 * @return kStatus_Success when Tamper Seconds Register is written
 */
status_t TDET_ForceTamper(DIGTMP_Type *base);

/*!
 * @brief Reads the Tamper Seconds Register.
 *
 * This function reads TDET Tamper Seconds Register. The read value returns the time in seconds at which the Status
 * Register DTF flag was set.
 *
 * @param base TDET peripheral base address
 * @param tamperTimeSeconds Time in seconds at which the tamper detection SR[DTF] flag was set.
 * @return kStatus_Fail when Tamper Seconds Register reading is not allowed
 * @return kStatus_Success when Tamper Seconds Register is read
 */
status_t TDET_GetTamperTimeSeconds(DIGTMP_Type *base, uint32_t *tamperTimeSeconds);

/*!
 * @brief Writes to the TDET Lock Register.
 *
 * This function clears specified lock bits in the TDET Lock Register.
 * When a lock bit is clear, a write to corresponding TDET Register is ignored.
 * Once cleared, these bits can only be set by VBAT POR or software reset.
 *
 * @param base TDET peripheral base address
 * @param mask Bit mask for the lock bits to be cleared. Use tdet_register_t values to encode (OR'ed) which TDET
 * Registers shall be locked.
 */
void TDET_LockRegisters(DIGTMP_Type *base, uint32_t mask);

/*! @}*/

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @}*/ /* end of group tdet */

#endif /* _FSL_TDET_H_ */
